psuiappserver/tIRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header/><SOAP-ENV:Body><nmwg:message xmlns="http://ggf.org/ns/nmwg/tools/org/perfsonar/1.0/" xmlns:bwctl="http://ggf.org/ns/nmwg/tools/bwctl/2.0/" xmlns:iperf="http://ggf.org/ns/nmwg/tools/iperf/2.0/" xmlns:nmtm="http://ggf.org/ns/nmwg/time/2.0/" xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/" xmlns:nmwgt="http://ggf.org/ns/nmwg/topology/2.0/" xmlns:perfsonar="http://ggf.org/ns/nmwg/tools/org/perfsonar/1.0/" xmlns:select="http://ggf.org/ns/nmwg/ops/select/2.0/" type="MetadataKeyRequest"><nmwg:metadata id="metadata-bwctl1"><bwctl:subject><nmwgt:endPoint/></bwctl:subject><nmwg:eventType>http://ggf.org/ns/nmwg/tools/bwctl/2.0</nmwg:eventType></nmwg:metadata><nmwg:metadata id="metadata1"><iperf:subject id="subject1"><nmwgt:endPointPair/></iperf:subject><nmwg:eventType>http://ggf.org/ns/nmwg/tools/iperf/2.0</nmwg:eventType><nmwg:parameters id="param1"/></nmwg:metadata><nmwg:metadata id="metadata1-2"><select:subject id="subject1-2" metadataIdRef="metadata1"/><nmwg:eventType>http://ggf.org/ns/nmwg/ops/select/2.0</nmwg:eventType><select:parameters id="param1-2"><nmwg:parameter name="startTime">1403181063</nmwg:parameter><nmwg:parameter name="endTime">1403267463</nmwg:parameter></select:parameters></nmwg:metadata><nmwg:data id="data1" metadataIdRef="metadata1-2"/></nmwg:message></SOAP-ENV:Body></SOAP-ENV:Envelope>